brew "bat"
brew "coreutils"
brew "difftastic"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "herdr"
brew "jq"
brew "less"
brew "mise"
brew "neovim"
brew "pinentry-mac"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "1password-cli"
cask "ghostty"
cask "raycast"
cask "remote-desktop-manager"
